Revit 2027 API
PrintManager.PrinterName Property
 The name of the current printer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PrinterName { get; }
Public ReadOnly Property PrinterName As String
	Get
public:
property String^ PrinterName {
	String^ get ();
}
member PrinterName : string with get
Property Value
String
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace